Repository: geniusdigitalcommerce/fac-woocommerce-gdc
Catalog: assets/languages/wcfacgdc-*.po
Languages: es

source: Add New Card
es: Agregar Nueva Tarjeta

source: Enable/Disable Payment Gateway
es: Habilitar/Deshabilitar Pasarela de Pago

source: Enable FAC Payment Gateway
es: Habilitar Pasarela de Pago FAC

source: Enable/Disable FAC Test Mode
es: Habilitar/Deshabilitar Modo de Prueba FAC

source: Enable Test Mode
es: Habilitar Modo de Prueba

source: Test mode enables you to test payments before going live. If you select this option, you must enter credentials for your TEST FAC account. When you are ready to accept live payments, uncheck this option and enter your PRODUCTION FAC account credentials.
es: El modo de prueba te permite realizar pruebas de pagos antes de ir en vivo. Si seleccionas esta opción, debes ingresar las credenciales de tu cuenta de prueba FAC. Cuando estés listo para aceptar pagos en vivo, desmarca esta opción e ingresa las credenciales de tu cuenta FAC DE PRODUCCIÓN.

source: Payment Method
es: Método de Pago

source: Authorize & Capture Payments Immediately
es: Autorizar y Capturar Pagos Inmediatamente

source: Authorize then Capture Payments Manually Later
es: Autorizar y Luego Capturar Pagos Manualmente

source: During authorization, the customer's card is verified and the balance is reserved on the card. During capture, the payment is taken from the customer's card and processed into the merchant's account. If you select "Authorize & Capture Payments Immediately" then both will be done during successful checkout on the website. However, if you select "Authorize then Capture Payments Manually Later" then the payment will be authorized on the customer's card, but you will have to manually capture the payment from the order page in Woocommerce.
es: Durante la autorización, se verifica la tarjeta del cliente y se reserva el saldo en la tarjeta. Durante la captura, el pago se toma de la tarjeta del cliente y se procesa en la cuenta del comerciante. Si seleccionas "Autorizar y Capturar Pagos Inmediatamente", ambos se realizarán durante el pago exitoso en el sitio web. Sin embargo, si seleccionas "Autorizar y Luego Capturar Pagos Manualmente", el pago se autorizará en la tarjeta del cliente, pero deberás capturar manualmente el pago desde la página del pedido en WooCommerce.

source: Enable/Disable 3D Secure
es: Habilitar/Deshabilitar 3D Secure

source: Enable 3D secure processing of payments
es: Habilitar procesamiento seguro 3D de pagos

source: Enable/Disable Address Verification (AVS)
es: Habilitar/Deshabilitar Verificación de Dirección (AVS)

source: Enable address verification checks
es: Habilitar verificación de dirección

source: Only enable this option if Address Verification (AVS) is supported by your merchant account & bank.
es: Habilita esta opción solo si la Verificación de Dirección (AVS) es compatible con tu cuenta de comerciante y banco.

source: Title of Payment Method
es: Título del Método de Pago

source: This is the title of the payment option which the user selects during checkout.
es: Este es el título de la opción de pago que el usuario selecciona durante el pago.

source: Description of Payment Method
es: Descripción del Método de Pago

source: This contains the description which the user sees during checkout.
es: Esto contiene la descripción que el usuario ve durante el pago.

source: Enable Tokenization
es: Habilitar Tokenización

source: Allow customers to securely save their payment details for future checkout. This is required for card registration or subscription services.
es: Permite a los clientes guardar de forma segura los detalles de su tarjeta para futuros pagos. Esto es necesario para el registro de tarjetas o servicios de suscripción.

source: Supported Card Types
es: Tipos de Tarjetas Soportados

source: FAC Merchant ID
es: ID del Comerciante FAC

source: The Merchant ID of your First Atlantic Commerce account.
es: El ID del Comerciante de tu cuenta en First Atlantic Commerce.

source: FAC Merchant Processing Password
es: Contraseña de Procesamiento del Comerciante FAC

source: The Processing Password of your First Atlantic Commerce account.
es: La Contraseña de Procesamiento de tu cuenta en First Atlantic Commerce.

source: FAC Order ID Prefix (3 Characters)
es: Prefijo de ID de Pedido FAC (3 Caracteres)

source: Enter a 3 digit order prefix to be used in the order IDs sent to FAC. This is sometimes useful if you use your FAC account to process transactions from multiple websites as it can allow you to easily pinpoint transactions from each website in your FAC merchant administration account.
es: Ingresa un prefijo de pedido de 3 dígitos que se utilizará en los ID de pedido enviados a FAC. Esto es útil si utilizas tu cuenta FAC para procesar transacciones de varios sitios web, ya que te permite identificar fácilmente las transacciones de cada sitio web en tu cuenta de administración de comerciante FAC.

source: FAC Transaction Cache Time
es: Tiempo de Caché de Transacciones FAC

source: The amount of seconds a FAC Transaction should take to be processed. Less times reduces the likelihood of possible security threats. 10 seconds recommended.
es: La cantidad de segundos que debería tomar una Transacción FAC para procesarse. Menos tiempos reducen la probabilidad de posibles amenazas de seguridad. Se recomiendan 10 segundos.

source: Show FAC & 3D Secure Logos At Checkout
es: Mostrar Logos de FAC y 3D Secure al Pagar

source: Enable Logos
es: Habilitar Logos

source: When enabled, the powered by FAC, Visa Secure, and Mastercard SecureCode logos will appear under the credit card form during checkout. This may be a required for approval of your website by FAC.
es: Cuando está habilitado, los logotipos de powered by FAC, Visa Secure y Mastercard SecureCode aparecerán debajo del formulario de tarjeta de crédito durante el pago. Esto puede ser necesario para la aprobación de tu sitio web por parte de FAC.

source: Force Display of Checkout Errors
es: Forzar Mostrar Errores de Pago

source: Checkout error messages are not being displayed.
es: Los mensajes de error de pago no se están mostrando.

source: Some themes do not display woocommerce error messages after the 3DS redirects. Check this box only if you notice that error messages are not displayed on your checkout page after a card is declined.
es: Algunos temas no muestran los mensajes de error de WooCommerce después de las redirecciones 3DS. Marca esta casilla solo si notas que los mensajes de error no se muestran en tu página de pago después de que se rechaza una tarjeta.
